---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter
source: html/499d9bfc-6cca-b995-942f-ac413e7e66dc.htm
---
# StructuralMaterialTypeFilter Members

Constructs a new instance of a filter to match family instances that have the given structural material type.